{"Not found":{"content":"404","meta":"Spezialseiten"},"Library":{"content":"<<Template:AppInfo\n|icon={{libicon.png}}\n|name=Library\n|developer=macniel\n|lang=[[CommonJS]]\n|company=private\n|frontend=[[Lux UI]]\n|backend=[[NodeJS]]\n>>\n**Library** is a lightweight Wiki Application written entirely in javascript, it runs on a nodejs hosting platform. It fully supports [[http://www.wikicreole.org/|Creole Markup]] to easily compose Rich Text.\nIt utilizes [[Lux UI]] as Layout Engine and JSON Search for fast unindexed searches.\n= Structure\nLibrary consists of several Modules which defines the behavior of the Application:\n* beeline, to control File retrieval and Resource handling\n* Topics, which controls topic listing, printing, saving and searching\n* wiky, which is the parsing module which converts WikiText to HTML\n* Files, which handles uploading and downloading of images\n= Features\n* Extended Creole Markup\n** includes template processing\n* Asychronized File Uploads\n* IntelliSense (currently under development)\n** whenever you type [[ (links), {{ (images) or << (templates) you will get a list of usable Topics or Files which can be pasted into your current WikiText\n* Fast Search Engine\n** Article titles and full text search enabled\n* Categorization of articles\n** you can file an article under several categories\n<<Template:Projects>>","meta":"Projects,Wiki,Javascript"},"Projects":{"content":"A List of Projects I am currently working on or had finished.\n__TOC__\n= Currently in Development\nMost of my current works are done for TuTech Innovation GmbH but I often find time for my own private projects.\n\n== Private projects\n* [[Library]] as a [[Personal Wiki]] written in SSJS - NodeJS\n* [[Green-Lagoon]] as a [[Content Management System|CMS]] written in PHP\n* [[Bloggo]] as a lightweight [[Content Management System|CMS]] written in CSJS - jQuery\n\n== Commercial projects\n* [[Rete]] as a [[Patent management System]] written in PHP - REST\n* Codename [[RFTool]] as a [[Form Creational Tool]] written in PHP - REST\n\n= Out-phased projects\n* [[Compact Revolutionary Texts|CRT]] \n* [[Compact Revolutionary Unitframes|CRUF]]\n* [[Improved Merchant]]\n* [[WatchSkills]]","meta":"Spezialseiten"},"Green-Lagoon":{"content":"**Green-Lagoon** is a [[Content Management System|CMS]] application written in PHP with a database connection to MySQL.\n<<Template:Projects>>","meta":"Projects,PHP,Content Management System"},"WatchSkills":{"content":"**WatchSkills** is an outdated World of Warcraft Addon.\n\n= Description\n\nDo you ever wanted to track your skills without having the blocky skill window opened ? Now you can watch similiar to the watched faction system one skill by simply checking the skill in the detail frame left to the progress bar.\n\nWhen you are currently watching a faction the reputationbar will be replaced with the tradeskillbar and vice versa.\n\nI hope you enjoy this AddOn and if you like it please rate, if you find a bug please comment it I will try to eliminate it.\n<<Template:Projects>>","meta":"Projects,World of Warcraft Addons"},"Improved Merchant":{"content":"<<Template:Image\n|image= {{pvw27101.png}}\n|caption= New Merchant Frame showing a list of purchasable items\n|width= 250px\n>>\n**Improved Merchant** was a highly appreciated World of Warcraft Addon.\n= Warning\nif you depend on item scaling and spacing between items do not upgrade and use version 3.6a instead, this update is not necessary if the previous version (3.6a) is working fine on your computer.\n\n= Installation\n\nYou install this AddOn like any other, just unpack the downloaded zip into your /Interface/AddOns folder.\n\n= Summary\nHello and welcome back to another helpful AddOn which will improves your daily shopping-adventures with merchants.\n\nOkay what did this AddOn do to your merchantframe ? It replaces the paged item display with a scrollable and more informative list which can also be filtered by available item types. It use the same purchase protection like the default merchantframe when buying an item which requires honor-,arena-points or specific items.\n\n= Features\n* Filter: you can filter items from a vendor out. You can setup a filter to show only trainable, usable, purchasable items or just items from a specific type (or subtype)\n* Searchcraft: you can search item descriptions for certain a or multiple (seperated by an colon ;) keywords and filter those out which does not include your keywords\n* Scrollable List: you can now scroll through the merchant shop instead of the paged view\n* Autorepair: as a request you can now check a button on a merchant frame to enable autorepair.\n\n= Credits\nThanks again to **Dridzt** who have uploaded a fixed version here [[http://www.wowinterface.com/downloads/info12206.html]] while I was not available. Thanks and kudos to you!\n\nThanks to **Seebs** for GetOpt which handels slashcommands / parameterized Inputs\n<<Template:Projects>>","meta":"Projects,World of Warcraft Addons"},"Compact Revolutionary Texts":{"content":"<<Template:Image\n|image={{CRT.png}}\n|width= 250px\n|caption=Outdated //Registry Editor//\n>>\nCompact Revolutionary Texts was a highly favorited World of Warcraft Addon.\n\n__TOC__\n= Description\n\nWelcome to a revolutionary Addon which could reform the thinking of UI Builders.\n\nCompact revolutionary Texts is a Data presentation Addon which can display simple informations like your current Location or your current Time or DogTagged Unit specific Informations like current HP or your TargetsTargetsName.\n\nHint: the Configmenu is draggable with the Right Mousebutton.\n\nThis release is just a refresh so that the gui settings are accessible again!\n\n= Changelog\n\n== Changes in CRT v109a\ncrt_registry: the Registry Module is now resizeable, rightclick and drag the bottomright cornor\n[bag] has been bugfixed\n\nyou can make interesting stuff with [calc] ! for example this:\n\n[calc : [cooldown:Reinkarnation]/60 > 1 and [cooldown:Reinkarnation] or [cooldown:Reinkarnation]:0]\n\nthis tag will show you the duration of reinkarnation in minutes, if the cooldown drops one minute it will displays at seconds, if the cooldown is 0 it will display \"ready\" - awesome right?\n\n== This has changed since CRTv108\ngold, silver and copper Money Tags were fixed\n* [mdurability: precision] - displays the minimal durability value of an weared Item\n\n== This has changed since CRTv107\nnew tags are now ready to use:\n* [durability: precision] - display your current durability of your inventory (not bags) in percent\n* [location: parameter] - enhanced location display by attributes:\n** map → display the text which are actually displayed on the minimap\n** zone → display only the zone title\n** dynamic → displays the maptitle or (sub-)/zone title\n* [friends: parameter] - display informations according your friendslist\n** online → display the count of online friends\n** count → display the count of online and offline friends\n* [guild: parameter] - displays various informations about your guild or none\n** name → display the name of your guild\n** online → display only online members\n** offline → display only offline members\n** count → display the count of online and offline members\n** rank → display your current rank\n* [pvp] - display your current pvp status :\n** pve - you are in a major city or a friendly zone\n** pvp - you are on a battlefield or in a contested zone\n** ffa - you are in the arena or gurubashi/diremaul arena\n* [cooldown: SkillOrItem] - display the Cooldown of the given Spell or Item\n* [stat: attribute] - display the +attribute on your current inventory, this requires ItemBonusLib\n* [reputation: parameter] - displays information about your watched faction:\n** min → allways 0 (if current falls under min you will loose a standing)\n** max → your needed reputation to gain the next standing\n** name → the name of your watched faction\n** current → your current progress to the next or previous standing\n** standing → return the current standing name eg. friendly or hated\n* [bag: parameter] - display information about your bagspace:\n** used →how many space is in use?\n** free → how many free space do you have?\n** maximum → maximal capacity of your bags\n\ncalc has been improved, it will now use this following syntax :\n* [calc:expression: precision] - precision must be given!\n\nthere is a new color :reputation which will format the following text by a colorcode based upon the armory-reputation colors.\n\n== Whats new in Version 1.07a\nDumb-check routines has been included. there will be less errors while parsing a wrong parameter\nnew Tag has been included: [calc: expression] -- it will evaluate the given expression, can be used to evaluate 2 tag values like [maxxp] and [currentxp] to recieve missingHP\n\n== Whats new in Version 1.07\nnew Syntax used: the former $tag#modifier# is now converted to [tag:modifier]\nmany of the modifierless Tags are now accepting modifiers:\ninteger modifier\n* [uplink: precision] \n* [downlink: precision]\n* [fps: precision] \n* [ramusage: precision]\n* [percentxp: precision]\n\nstring or hex modifier\n* [color: name] or [color: AARRGGBB]\n\nstring modifier\n* [skilllevel: skillname] \n* [skillmaxlevel: skillname] \n* [itemcount: item]\n* [classcolor: CLASS]\nnow you can use defined colornames as color codes:\n\nred blue lime yellow violet orange black white gold silver\ncopper\nnew Tags were been added\n\n* [copper] -- display your ammount of copper-coins\n* [silver] -- display your ammount of silver-coins\n* [gold] -- display your ammount of gold-coins\n* [classcolor: CLASS] -- display the following string with the color of the given\\\\\nclass, when no parameter is given it will color it by your current class.\n\nhighly performant parser module has been recoded\n\nthanks to you Kuchen for your help. the parser module will now generate hardly\ngarbage so it will be use even less memory than before (127KiB - 139KiB)\nOverride for Localization has been added with other clients than deDE and enUS (this includes the ELP enGB) there were\nno captions in the configuration tool and no labels for [mail] and [tracking].\n\nthis has been overridden, help me to localize this AddOn into your native\nlanguage - mail me at macniel<at>gmx<dot>de or leave me a message at \nwowinterface<dot>com\n\nMinor fixes as usual\n\nPlease Note: your old Profile will not work probably due to the new Syntax.\n\n== Whats new in Version 1.06\nAce2 is no longer embedded which removes a big overhead of ram usage - Ace2 as an embedded library or as standalone will be loaded to enable various Ace2 advantages\n\nif Ace2 is found CRT will try to load an existing DogTag-2.0 copy and evaluate DogTags against it\nif there is a SharedMedia Library it will be used by the Load On Demand Registry Editor to give you a dropdown list with selectable fonts\n\nSome new basic tokens have been added:\n* $currentxp : will display your current amount of experience points\n* $maxxp : will display the needed eperience points to level up\n* $percentxp : will display your current amount of experience points in percent with a precision of 1 (e.g. 87.2)\n* $nextlvl : will display your next level (e.g. when you are level 38 it will display 39)\n* $lvl: will display your current level\n* $classcolor: format the following chars in your current classcolor\nThe Configuration tool (folder: crt_Registry) called \"Gaius' Registry Editor is now Load On Demand - it will loaded when you enter /crt gui (which will also open it)\n\n3 Default Profiles has been added:\nLyniviels CFL - namend after Lyniviels Clock Fps Latency Addon\n\nLyn Rainbow Colors - Based upon LynStats\n\nDEFAULT - Mighty chuck of information\n\n== fixes in Version v1.05e\nImproved parser cycle (only one cycle per second per addon not per element) which will reduce the memory usage amazingly\n\nWrong framestrata and framelevel db allocation, now framestrata use all possible stratas\n.toc update\n\n== thats new in Version v1.05\nSharedMedia Support, it will display now a Dropdown Menu for all registerd Fonts so you can easily select a Font without giving the full fontpath (SharedMedia is not embedded)\n\nFixed Profile Management, the Profiles will now be selectable from a secondary Frame where you can Load Delete and Create a New Profile - due some problems with unloading previously Frames you should reload your UI after selecting a new Profile\n\nFixed some localization based problems\n\n== thats new in Version v1.04\nNew performant Datastructure and Per Character based Profiles\n\nDogTag-1.0 is now replaced by LibDogTag-2.0\n\nNew Basic Tokens:\n* $itemcount#Itemname# : display the current amount of items\n* $ammocount : displays your current ammunition (projectiles or arrows)\n* $skilllevel#Skill# : display your current progress in Skill\n* $skillmaxlevel#Skill# : display your current cap in Skill (e.g. 75 as an journeyman in a tradeskill)\n\nNew format : Shadowing, you can give your Labels a Shadow with Offset and custom Coloring / opacity\n\nLayering : you can now set the Frame Strata and Frame Level\n\nNew english Localization created by Ileron\n\nNew Configuration tool : Registry Editor, it use an embedded Registry structure and the crt_commander to create a very  fast Configuration for your Labels - you can access it by /crt gui\n\n== since v1.04:\n\nMany bugfixes, which have caused inoperability.\n<<Template:Projects>>","meta":"Projects,World of Warcraft Addons"},"PHP":{"content":"**PHP** is a general-purpose server-side [[scripting language]] originally designed for [[web development]] to produce [[dynamic web page]]s.  For this purpose, PHP code is embedded into the [[HTML]] source document and interpreted by a [[web server]] with a PHP processor module, which generates the [[web page]] document. It also has evolved to include a [[command-line interface]] capability and can be used in [[Standalone software|standalone]] [[Graphical user interface|graphical applications]]. PHP can be deployed on most web servers and as a standalone interpreter, on almost every [[operating system]] and [[Platform (computing)|platform]] free of charge. A competitor to [[Microsoft]]'s [[Active Server Pages]] (ASP) server-side script engine and similar languages, PHP is installed on more than 20 million websites and 1 million [[web server]]s.\n\nPHP was originally created by [[Rasmus Lerdorf]] in 1995. The main implementation of PHP is now produced by The PHP Group and serves as the [[de facto standard|''de facto'' standard]] for PHP as there is no [[formal specification]]. PHP is [[free software]] released under the [[PHP License]] which is incompatible with the [[GNU General Public License]] (GPL) due to restrictions on the usage of the term ''PHP''.\n\nWhile PHP originally stood for \"Personal Home Page\", it is now said to stand for \"PHP: [[Hypertext Preprocessor]]\", a [[recursive acronym]].","meta":"Programming Language"},"Wiki":{"content":"A **wiki** is a [[website]] that allows the creation and editing of any number of [[free links|interlinked]] [[web page]]s via a [[web browser]] using a simplified [[markup language]] or a [[WYSIWYG]] text editor. Wikis are typically powered by [[wiki software]] and are often [[Collaborative software|used collaboratively]] by multiple users. Examples include community websites, corporate [[intranet]]s, [[knowledge management]] systems, and note services. The software can also be used for personal [[Notetaking software|notetaking]].\n\nWikis serve different purposes. Some permit control over different functions (levels of access). For example editing rights may permit changing, adding or removing material. Others may permit access without enforcing access control. Other rules can be imposed for organizing content.\n\n[[Ward Cunningham]], the developer of the first wiki software, [[WikiWikiWeb]], originally described it as \"the simplest online database that could possibly work.\" //Wiki// or //viti// is a [[Hawaiian language|Hawaiian]] word meaning \"fast\" or \"quick\".\n\n==History\nWikiWikiWeb was the first wiki. Ward Cunningham started developing WikiWikiWeb in Portland, Oregon, in 1994, and installed it on the c2.com on March 25, 1995. It was named by Cunningham, who remembered a [[Honolulu International Airport]] counter employee telling him to take the \"[[Wiki Wiki Shuttle]]\" bus that runs between the airport's terminals. According to Cunningham, \"I chose wiki-wiki as an alliterative substitute for 'quick' and thereby avoided naming this stuff quick-web.\"\n\nCunningham was in part inspired by Apple's [[HyperCard]]. Apple had designed a system allowing users to create virtual \"card stacks\" supporting links among the various cards. Cunningham developed [[Vannevar Bush|Vannevar Bush's]] ideas by allowing users to \"comment on and change one another's text.\"\n\nIn the early 2000s, wikis were increasingly adopted in enterprise as collaborative software. Common uses included project communication, intranets, and documentation, initially for technical users. Today some [[corporate wiki|companies use wikis]] as their only collaborative software and as a replacement for static intranets, and some schools and universities use wikis to enhance [[group learning]]. There may be greater use of wikis behind [[Firewall (computing)|firewalls]] than on the public Internet.\n\nOn March 15, 2007, ''wiki'' entered the online ''[[Oxford English Dictionary]]''.","meta":"Spezialseiten"},"Content Management System":{"content":"A **content management system** (**CMS**) is a system providing a collection of procedures used to manage work flow in a collaborative environment. These procedures can be manual or computer-based. The procedures are designed to do the following:\n* Allow for a large number of people to contribute to and share stored data\n* Control access to data, based on user roles (defining which information users or user groups can view, edit, publish, etc.)\n* Aid in easy storage and retrieval of data\n* Reduce repetitive duplicate input\n* Improve the ease of report writing\n* Improve communication between users\n\nIn a CMS, data can be defined as nearly anything: documents, movies, pictures, phone numbers, scientific data, and so forth. CMSs are frequently used for storing, controlling, [[version control|revising]], semantically enriching, and publishing documentation. Serving as a central repository, the CMS increases the version level of new updates to an already existing file. Version control is one of the primary advantages of a CMS.\n\n==Enterprise content management systems\nAn enterprise content management system (ECM) is content, documents, details and records related to the organizational processes of an enterprise. The purpose and result is to manage the organization's unstructured information content, with all its diversity of format and location. The system manages the content related to commercial organizations. The main objectives of Enterprise content management are to streamline access, eliminate bottlenecks, optimize security and maintain integrity.\n\n==Component content management system\nIn a component content management system (CCMS), the content is stored and managed at the sub-document (or component) level for greater content reuse.\n\nCMS has five main functions:\n# Maintaining Security\n# Managing Objects\n# Managing Servers\n# Managing Auditing\n# Maintaining Reports.","meta":"Spezialseiten"},"Javascript":{"content":"**JavaScript** is a [[prototype-based]] [[scripting language]] that is [[dynamic language|dynamic]], [[weak typing|weakly typed]] and has [[first-class functions]]. It is a [[multi-paradigm]] language, supporting [[Object-oriented programming|object-oriented]], [[imperative programming|imperative]], and [[functional programming|functional]] programming styles.\n\nJavaScript was formalized in the [[ECMAScript]] language standard and is primarily used in the form of [[client-side JavaScript]], implemented as part of a [[Web browser]] in order to provide enhanced [[user interface]]s and dynamic [[website]]s. This enables [[Computer programming|programmatic]] access to computational objects within a host environment.\n\nJavaScript's use in [[Application software|applications]] outside Web pages&nbsp;— for example in [[Portable Document Format|PDF]] documents, [[site-specific browser]]s, and [[desktop widget]]s&nbsp;— is also significant. Newer and faster JavaScript [[Virtual machine|VMs]] and frameworks built upon them (notably [[Node.js]]) have also increased the popularity of JavaScript for server-side web applications.\n\nJavaScript uses syntax influenced by that of [[C (programming language)|C]]. JavaScript copies many names and naming conventions from [[Java (programming language)|Java]], but the two languages are otherwise unrelated and have very different semantics. The key design principles within JavaScript are taken from the [[Self (programming language)|Self]] and [[Scheme (programming language)|Scheme]] programming languages.","meta":"Programming Language"},"Programming Language":{"content":"A **programming language** is an artificial [[language]] designed to communicate [[Machine_instruction|instructions]] to a [[machine]], particularly a [[computer]].  Programming languages can be used to create [[program (machine)|programs]] that control the behavior of a machine and/or to express [[algorithm]]s precisely.\n\nThe earliest programming languages predate the [[History of computing hardware|invention of the computer]], and were used to direct the behavior of machines such as [[Jacquard loom]]s and [[player piano]]s. Thousands of different programming languages have been created, mainly in the computer field, with many more being created every year. Most programming languages describe computation in an [[imperative programming|imperative]] style, i.e., as a sequence of commands, although some languages, such as those that support [[functional programming]] or [[logic programming]], use alternative forms of description.\n\nA programming language is usually split into the two components of [[syntax]] (form) and [[semantics]] (meaning). Some languages are defined by a specification document (for example, the [[C (programming language)|C]] programming language is specified by an [[International Organization for Standardization|ISO]] Standard), while other languages, such as [[Perl]], have a dominant [[Programming language implementation|implementation]] that is used as a [[reference implementation|reference]].","meta":"Spezialseiten"},"RaidFramesPlus":{"content":"**RaidFrames+** is another set to improve the game experience with the standard interface provided with the latest version of World of Warcraft.\n\nI have resumed this project (which started with the not so popular MacTools) because the current RaidFrames have been improved with Wrath of the Lich King but not as much as I wished (and other RaidFrames looks just deplaced in the default Interface).\n\n= What does this AddOn do to the RaidFrames\n\nCurrently this AddOn adds ( or improves ) these functions in the raidframes:\n* Debuff-highlightning : the frame of an affected Raidmember will glow in the corresponding debuff color also the Debuff is moved within the UnitButton to save screen estate.\n* Custom Aura-Highlightning : define in a special list in which color a Raidmember should be highlighted if it has a defined aura (by name)\nHealthtext: over the Health and Manabar there is now a number that display the current Health of this unit\n* 4 Different displaytypes of Health:\n** absolute values,\n** deficite values (mainly for healers),\n** big k values ( values bigger than 1,000 will be represented as thousands) and\n** percent values\n* NEW : custom format (see below)\n* Aggro : the littel dot next to the healthbar is a nice addition by Blizzard, but for me it is hard to distinguish; so the Healthtext will be colored by the current ThreatSituation (Red : tanking; Orange: Winning on Threat; Yellow: hardly tanking)\n* RaidIcons: right next to the UnitButtons thier should be the current raid target icon (lucky charms) displayed\n* Fixed Borders: of Healthbars and Manabars\n* Graphical Interface Configuration Panel\n* Enhanced Healthar display modi:\n** Allways doublesize : this option will hide the manabar and increase height of the healthbar by 200%\n** No Mana: this option will hide the manabar if the unit has no mana as powersource (rogues, warriors, deathknights, non caster-pets, vehicles) and increase the height of the healthbar (in this mode those raidframes looks like xperl in blizzard style)\n** Never : the healthbar is untouched and the manabar is displayed as usual\n* Mass-toggle between debuff and buff display (this is useful during buffing the raid) inspired by lab1702 and his addon RaidPulloutOrganizer\n\n= how to configure this AddOn?\n\nThe configuration will be done via the interface options, but you have to use\n\n{{{\n/rfp -d\n}}}\n\nto mass-toggle between buffs and debuffs.\n<<Template:Projects>>","meta":"World of Warcraft Addons,Projects"},"Rete":{"content":"**Rete Datenbank** is a Patent Management Tool written in PHP for PVA Hamburg, which are dealing with Universities and Idea Gatherings.\n\nIt utilize the current [[Lux UI]] Version, which is also used in [[RFTool]]\n<<Template:Projects>>","meta":"PHP,Projects"},"RFTool":{"content":"Codename **RFTool** is a **r**gistration**f**orm authoring Tool. It simplify the process to generate HTML Forms, to validate those and to respond to submissions, e.g. sending a Email or storing it in a local database.\n\n\nIt supersede //RFTool// written for [[TuTech Innovation GmbH]].\n\n\n<<Template:Projects>>","meta":"Projects,PHP"},"Lux UI":{"content":"<<Template:AppInfo\n|icon= {{luxcon.png}}\n|name= Lux UI\n|developer= Macniel\n|company= private\n|lang = independent\n>>\n**Lux UI** is a ''Graphical Paradigm'' estalibshed by me. It is used in Web Applications like [[Library]], [[Rete|Rete Datenbank]] and //[[RFTool]]//. \nIt describes a two column interface, which the left one is for navigation and the center one for Content view and or editing. \n__TOC__\n= Layout \n{{luxui.png}}\n|=Sectionname |= purpose |\n| siteTools   |  provides controls which affect global behavior of the app e.g. Login/Logout Control or a Searchbar |\n| cmdBar      |  provides content contextual commands, like editing the current File or append a new subfile to the selected file |\n| navPane     | lists every file and subfile which are accessible by the current user |\n| contentPane | displays a file or an editing interface to this file |\n| logo        | Applications Icon or Company Logo |\n| appName     | Name of the Entire Application |\n\n== navPane\n\nThe Navigational Pane represents the entire catalog of available or accessible files, which could be outlined in sub categories and subfiles. \n\n== Commandbar\n\nThe Commandbar holds up to 5 distinct Buttons, which can toggle menus if more contextual actions are needed. Those Buttons **do not have** text but images and mouse over titles to describe the action. \n\n= Colorthemes\n\nnavPane and contentPane do have a distinct header coloring which resembles the appIcon or the general Theme. The Main Coloring of Library is blue, so these headers do have a blue gradient. In RFTool the main color Theme is Orange.\n\n\nIt is a necessity that a colortheme do consists of maximal 3 (excluding white, black and link color) colors but can have different hues of those.\n","meta":"Projects"},"Template:Stuff":{"content":"<div style=\"background-color: blue; color: white; float: right\">\nHello <<<user>>>, today is a good day to //<<<action>>>//.\n</div>","meta":"Templates"},"Template:Projects":{"content":"<table style=\"width: 100%; border-collapse: collapse; border: 1px solid silver\">\n<tr>\n<th colspan=\"2\" style=\"background-color: #efefef; font-weight: normal;\">//Projects//<span style=\"float: right; padding-right: 4px\"> [[Template:Projects|v]]</span></th>\n</tr>\n<tr style=\"border-bottom: 1px solid silver\">\n<th style=\"background-color: #efefef; font-weight: normal;\">Future Projects</th>\n<td style=\"font-size: .9em\"> [[Todo]], [[Music]]</td>\n</tr>\n<tr style=\"border-bottom: 1px solid silver\">\n<th style=\"background-color: #efefef; font-weight: normal;\">Current Projects</th>\n<td style=\"font-size: .9em\"> [[Library]], [[Green-Lagoon]], [[Rete]], [[RFTool]]</td>\n</tr>\n<tr>\n<th style=\"background-color: #efefef; font-weight: normal;\">Outdated Projects</th>\n<td style=\"font-size: .9em\"> [[Library]], [[Improved Merchant]], [[WatchSkills]], [[Compact Revolutionary Texts]], [[RaidFramesPlus]]</td>\n</tr>\n</table>","meta":"Templates"},"Startseite":{"content":"**Library** is a lightweight Wiki Application written entirely in javascript, it runs on a nodejs hosting platform.\nIt fully supports Creole Markup to easily compose Rich Text. This Library contains __PAGECOUNT__ pages.\n\nIt utilies [[Lux UI]] as Layout Engine and JSON Search for fast unindexed searches.\n= Structure\n**Library** consists of serveral //Modules// which defines the behavior of the Application:\n* beeline, to control File retrival and Resource handling\n* Topics, which controls topic listing, printing, saving and searching\n* wiky, which is the parsing module which converts WikiText to HTML\n* Files, which handles uploading and downloading of images\n= Features\n* Extended Creole Markup\n** includes template processing\n* Asychronized File Uploads\n* IntelliSense (currently under development)\n** whenever you type [[ (links), {{ (images) or << (templates) you will get a list of usable Topics or Files which can be pasted into your current WikiText \n* Fast Search Engine\n** Article titles and full text search enabled\n* Categorisation of articles\n** you can file an article under several categories","meta":"Spezialseiten"},"Template:AppInfo":{"content":"<div style=\"font-size: 0.9em; float:right; text-align: center; border: 1px solid silver; background-color: #efefef; padding: 4px; margin-left: 8px\">\n <span style=\"text-align: center; font-weight: bold; display: block; font-size: 1em\"><<<name>>></span>\n <<<icon>>>\n <table style=\"text-align: left; border: 1px solid silver; background-color: white\">\n <tr>\n  <td>Company<td><<<company>>></td>\n </tr>\n <tr>\n  <td>Developed by<td><<<developer>>></td>\n </tr>\n <tr>\n  <td>Written in<td><<<lang>>></td>\n </tr>\n <tr>\n  <td>Backend<td><<<backend>>></td>\n </tr>\n <tr>\n  <td>Frontend<td><<<frontend>>></td>\n </tr>\n </table>\n</div>","meta":"Templates"},"Template:Image":{"content":"<div style=\"float: right; text-align: center; width:<<<width>>>; font-size: 0.8em; font-weight: bold; border: 1px solid silver; display: inline-block; background-color: #efefef; padding: 8px\">\n <<<image>>><br>\n<<<caption>>>\n</div>","meta":"Templates"},"Todo":{"content":"<<Template:AppInfo\n|icon={{todoicon.png}}\n|name=Todo\n|developer=macniel\n|lang=[[CommonJS]]\n|company=private\n|frontend=[[Lux UI]]\n|backend=[[NodeJS]]\n>>\n**Todo** is a proposed lightweight Taskplanning Application written entirely in javascript, it will run on a nodejs hosting platform. It will also utilize [[Lux UI]] as Layout Engine and JSON Search for fast unindexed searches.\n\n<<Template:Projects>>","meta":"Projects"},"Music":{"content":"<<Template:AppInfo\n|icon={{musicicon.png}}\n|name=Music\n|developer=macniel\n|lang=[[CommonJS]]\n|company=private\n|frontend=[[Lux UI]]\n|backend=[[NodeJS]]\n>>\n**Music** is a proposed lightweight Music archiving and streaming Application written entirely in javascript, it will run on a nodejs hosting platform. It will utilize [[Lux UI]] as Layout Engine.\n<<Template:Projects>>","meta":"Projects"}}